#請撰寫一程式，讓使用者輸入一個正整數，將此正整數以反轉的順序輸出，並判斷如輸入0，則輸出為0。
n1 = input()#必須要是文字格式
listA=[]
str1=''
for i in n1:
    listA.append(i)
listA.reverse()#翻轉
for i in listA:#把listA變字串
    str1+=i
print(str1)

# =============================================================================
# python專屬寫法
# number = input()
# print(number[::-1])
# =============================================================================

# =============================================================================
# 示範寫法
# num1=eval(input())
# if num1 == 0:
#     print(num1)
# else:
#      while num1 != 0:
#          print(num1 % 10,end='')
#          num1 //= 10
# =============================================================================
